# Урок 11 Хороший программист
# Классы

=begin

Как работать с классами:
1) Классы нужно создавать в отдельном файле и файл должен называться также, как название класса 
2) Нет стандартных классов в библиотеках
3) Создавать классы только тогда, когда нужен новый тип объекта с самостоятельным поведением
4) Давать классу осмысленное имя (а не class1, class2 )


Как использовать класс:
1) Объявить класс в файле
2) def initialize - это конструктор
3) Наполнить содержимым
4) Создать объект класса
5) Метод - Поля класса определяют состояние класса через ПЕРЕМЕННУЮ, 
задаются с помощью @ и находятся в функции def initialize
